@extends('layouts.app')

@section('content')
<div class="container">
    <div class="panel panel-default">
        <div class="panel-body">
            @include('modules.news-carousel')
        </div>
    </div>
</div>

<div class="container">
    <div class="panel panel-default">
        <div class="panel-heading">{{ __('main.college_history') }}</div>

        <div class="panel-body">
            <p>Технічний коледж відкрито за погодженням з Кабінетом Міністрів України згідно з наказом Міністерства освіти за №436 від 07.12.1993 р. на базі Тернопільського технікуму радіоелектронного приладобудування та Тернопільського професійно-технічного училища №9.</p>
            <p>Технічний коледж Тернопільського державного технічного університету створений наказом Міністерства освіти України №218 від 20 червня 1997., відповідно до Указу Президента України від 12 вересня 1996 року №832/95 "Про основні напрямки реформування вищої освіти України" та на виконання Постанови Кабінету Міністрів України від 29 травня 1997 року №526 "Про вдосконалення мережі вищих та професійно-технічних навчальних закладів" на базі Технічного коледжу Тернопільського державного технічного університету з делегуванням йому зі сторони Університету прав фінансово-господарської діяльності в межах, передбачених Статутом Університету і Положенням про Технічний коледж Тернопільського державного технічного університету.</p>
            <p>Технічний коледж Тернопільського державного технічного університету (надалі Коледж) є структурним підрозділом Тернопільського державного технічного університету імені Івана Пулюя, (надалі Університет), що здійснює підготовку фахівців з технічного, економічного, гуманітарного напрямків за спорідненими до Університетських спеціальностями, професійно-освітніми програмами, проводить культурно-просвітницьку діяльність серед населення, має високий рівень кадрового та матеріально-технічного забезпечення такої діяльності.</p>
            <p>Коледж засновано на державній формі власності і на даний час підпорядковано Міністерству освіти України.</p>
            <p>Освітня діяльність з підготовки фахівців відповідно до ліцензій проводиться на рівні кваліфікаційних вимог до бакалавра, молодшого спеціаліста та кваліфікованого робітника.</p>
            <p>Формування контингенту студентів коледжу проводиться у відповідності до планів прийому, які щорічно встановлються Міністерством освіти України.</p>
            <p>З 1994 р. коледж розпочав прийом студентів на контрактній основі. З 1997 по 1999 рік кількість заяв на одне планове місце на денну форму навчання змінювалась відповідно: 1,81; 2,16; 2,49, що вказує на тенденцію збільшення.</p>
            <p>Навчання з усіх спеціальностей ведеться з 1996 року згідно з типовими освітньо-професійними програмами підготовки молодших спеціалістів, на основі яких підготовлені робочі навчальні плани, які затверджені проректором з навчальної роботи ТДТУ ім. І. Пулюя, погоджені з інститутом змісту і методів навчання та Головним управлінням вищої освіти Міносвіти України.</p>
            <p>До навчальних планів внесені зміни згідно з Інструктивним листом Міністерства освіти України за №1/9-64 від 19.05.93 р. "Про викладання соціально-гуманітарних дисциплін", №1-5/748 від 20.07.1993 р. "Про внесення змін та доповнень до Інструктивного листа Міністерства освіти", №872 від 29.07.97 р. "Про перелік діючих програм дисциплін загальноосвітнього циклу", №1/11-687 від 19.04.96 р. "Про організацію занять з фізичного виховання", №842 від 22.07.97 р. "Про термін і послідовність вивчення гуманітарних і соціально-економічних дисциплін".</p>
            <p>Навчальні робочі плани відповідають вимогам освітньо-професійних програм, змісту підготовки спеціалістів та потребам регіону. До них щорічно вносяться зміни та доповнення з урахуванням вимог виробництва, змін технології.</p>
            <p>Більшість програм дисциплін розроблено викладачами коледжу. Програми розглянуті на засіданнях циклових комісій.</p>
            <p>Організаційно-методичне забезпечення навчально-виховного процесу базується на законах "Про освіту", "Про мови" та регламентується директивно-нормативними документами Міністерства освіти і науки України: (накази №161 від 02.06.93 р. "Про затвердження Положення про організацію навчального процесу у вищих навчальних закладах", №93 від 08.04.93 р. "Про затвердження Положення про проведення практики студентів вищих навчальних закладів України" та інші).</p>
            <p>Всі нормативно-директивні документи, які регламентують навчальний процес у коледжі, є у наявності і доводяться до відома педагогічного колективу на педрадах, виробничих нарадах з педпрацівниками і засіданнях циклових комісій.</p>
            <p>Підвищення кваліфікації викладачів відбувається в Тернопільському інституті післядипломної освіти, в Тернопільському державному технічному університеті ім. І. Пулюя, в Тернопільському педагогічному університеті ім. Гнатюка, на підприємствах м. Тернополя та області. За останні три роки підвищили кваліфікацію за фахом 61% викладачів.</p>
            <p>Навчально-матеріальна база коледжу відповідає вимогам навчальних планів і програм та санітарно-гігієнічним нормам і дозволяє у повному обсязі забезпечити підготовку фахівців. Матеріальна база комп'ютеризації навчального процесу постійно змінюється в якісному та кількісному виглядах.</p>
            <p>Фінансова діяльність коледжу здійснюється за рахунок коштів державного бюджету, коштів платного навчання, коштів від оренди приміщень (не за рахунок навчальної площі). Бюджетні асигнування використовуються за прямим призначенням.</p>
            <p>Рівень фахової підготовки студентів всіх спеціальностей коледжу визначався шляхом аналізу звітної документації з виробничої практики, курсових і дипломних проектів, результатів виконання студентами випускних курсів комплексних кваліфікаційних завдань, відгуків керівників підприємств про молодих спеціалістів протягом 3 років.</p>
        </div>
    </div>
</div>
@endsection
