@extends('layouts.app')

@section('content')
<div class="container">
    <div class="panel panel-default">
        <div class="panel-heading">{{ __('main.cycle_commission') }}</div>

        <div class="panel-body">
            <p>Голова циклової комісії: Марціяш Галина Ярославівна – викладач вищої категорії, викладач-методист</p>
            <p><strong>Склад комісії</strong><br> Циклова комісія налічує 8 викладачів:</p>
            <ul>
                <li>Довгань Володимир В’ячеславович</li>
                <li>Лісовий Олександр Миколайович</li>
                <li>Марціяш Галина Ярославівна</li>
                <li>Радчик Галина Іванівна</li>
                <li>Слободян Руслан Олесійович</li>
                <li>Фірман Іван Йосипович</li>
                <li>Цимбалюк Людмила Володимирівна</li>
                <li>Штокало Володимир Ярославович</li>
            </ul>
            <p><strong>Завдання циклової комісії</strong><br> У наш час інформація стає головним ресурсом, який потрібно організовувати, охороняти, керувати його кругообігом. Персональні комп’ютери є майже у всіх, вони стають незамінними помічниками у всіх сферах діяльності людини.</p>
            <p>Мати професію, яка б забезпечила стабільне майбутнє, – це бажання кожної людини. Тому у переліку перспективних спеціальностей напрям "Комп’ютерні науки та інформаційні технології” займає особливе місце. Без комп'ютерів нам уже не обійтися! Тому завжди потрібні люди, що можуть перетворювати геніальні ідеї і корисні поради у прості і доступні програми. Програміст - одна з професій сучасності. Програміст повинен відмінно знати не тільки теорію своєї роботи, але і бути чудовим практиком.</p>
            <p>Основними завданнями циклової комісії програмних систем та комплексів є підготовка висококваліфікованих працівників в галузі комп’ютерної техніки та програмування, майбутнього конкурентоспроможного спеціаліста, громадянина, патріота своєї держави.</p>
            <p>Систематично члени комісії проводять засідання циклової комісії, на яких обговорюють питання методичної роботи, впровадження інтерактивних та інформаційно-комунікативних технологій навчання, удосконалення методичної роботи кожного викладача - члена комісії, підвищення їх кваліфікаційного рівня, вивчення, узагальнення і розповсюдження передового педагогічного досвіду, застосування нових педагогічних технологій, вдосконалення навчально-матеріальної бази та розробки методичних рекомендацій з використання наочних посібників та інформаційно-комунікаційних технологій, ефективної організації самостійної роботи студентів, удосконалення форм організації роботи циклової комісії.</p>
            <p>Викладачі активно працюють над методичними розробками, беруть участь у методичних семінарах, поповнюють навчальний процес матеріалами для виконання практичних та лабораторних робіт. Використовують мультимедійні засоби на навчальних заняттях.</p>
            <p>Для ефективної підготовки фахівців використовуються спеціалізовані кабінети і лабораторії:</p>
            <ul>
                <li>Мікросхемотехніки та мікропроцесорних систем (ауд. 101);</li>
                <li>Основ інформатики та комп’ютерної техніки (ауд.102);</li>
                <li>Технічного обслуговування ЕОМ (ауд.103);</li>
                <li>Основ інформатики та комп’ютерної техніки (ауд.104);</li>
                <li>Програмування (ауд. 206);</li>
                <li>Технічного обслуговування та архітектури ЕОМ (ауд. 207);</li>
                <li>Програмування та алгоритмічних мов (ауд.219);</li>
                <li>Систем автоматизованого проектування та моделювання. Архітектури ЕОМ (ауд.220);</li>
                <li>Кабінет дипломного проектування та комп’ютерних практик (ауд.317);</li>
                <li>Комп’ютерних мереж та мережевих технологій (ауд.315).</li>
            </ul>
            <p>Всі кабінети об’єднані в локальну комп’ютерну мережу коледжу, яка має вихід в Інтернет. Функціонує електронна бібліотека коледжу, де студенти можуть працювати з електронними посібниками та іншими матеріалами, які надали викладачі ЦК, або використовувати зовнішні ресурси.</p>
            <p><strong>Коротка історія комісії</strong><br> Інформаційні технології займають одне з провідних місць в навчально-виховному процесі Технічного коледжу ТНТУ ім. І. Пулюя. Початком становлення цього напрямку було створення в 1987 році навчально-обчислювального центру на базі ЕОМ ЄС ИЗОТ. Керував робою цього центру Фірман І.Й. В 1998 році було ліцензовано спеціальність «Обслуговування комп’ютерних та інтелектуальних систем і мереж». З метою забезпечення якісної підготовки молодших спеціалістів даної спеціальності було відокремлено циклову комісію інформатики та обчислювальної техніки, яка до цього часу входила в циклову комісію&nbsp; математики та інформатики. Головою ЦК в період з 1998 до 2001 року була Марціяш Г.Я. Першими членами нової циклової комісії були Марціяш Г.Я., Дячук С.Д., Капаціла І.Б., Цимбалюк Л.В., Фірман І.Й., Юзьків А.В. З 2001 року циклову комісію очолив Фірман І.Й. В 2003 році циклову комісію інформатики та обчислювальної техніки реорганізовано в циклову комісію комп’ютерних дисциплін із призначенням Юзьківа Андрія Васильовича головою комісії.</p>
            <p>1 вересня 2015 р. у зв’язку із одержанням ліцензії на підготовку молодших спеціалістів за спеціальністю «Обслуговування програмних систем та комплексів», циклову комісію комп’ютерних дисциплін реорганізовано в дві нові:</p>
            <ul>
                <li>Циклову комісію програмних систем та комплексів (голова ЦК Марціяш Г.Я.).</li>
                <li>Циклову комісію комп’ютерних систем і мереж (голова ЦК Юзьків А.В.).</li>
            </ul>
            <p>Перший набір в групу підготовки фахівців за спеціальністю 5.05010101 «Обслуговування програмних систем та комплексів» було здійснено у 2013 р.</p>
            <p>Згідно із наказом Міністерства освіти і науки України від 06 листопада 2015 року № 1151 змінено найменування спеціальності і галузі знань, за якими здійснюється підготовка молодших спеціалістів викладачами даної циклової комісії на наступні:<br> Шифр та найменування галузі знань - 12 Інформаційні технології.<br> Код та найменування спеціальності - 122 Комп’ютерні науки та інформаційні технології.</p>
        </div>
    </div>
</div>
@endsection
