<?php

return [
    'no_news_found' => 'Новости не найдены',
    'created' => 'Создано',
    'author' => 'Автор',
    'views' => 'Просмотры',
    'article_name' => 'Название статьи',
    'full_article_text' => 'Полный текст статьи',
    'short_article_description' => 'Краткое описание статьи',
    'add_news' => 'Добавить новость',
    'edit_news' => 'Редактировать новость',

    'r_title' => 'Необходимо указать название статьи',
    'r_short_message' => 'Вы должны указать краткое описание статьи',
    'r_message' => 'Вы должны указать полный текст статьи'
];