<?php

return [
    'no_news_found' => 'Новин не знайдено',
    'created' => 'Створено',
    'author' => 'Автор',
    'views' => 'Перегляди',
    'article_name' => 'Назва статті',
    'full_article_text' => 'Повний текст статті',
    'picture' => 'Зображення',
    'short_article_description' => 'Короткий опис статті',
    'add_news' => 'Додати новину',
    'edit_news' => 'Редагувати новину',

    'r_title' => 'Необхідно вказати назву статті',
    'r_short_message' => 'Необхідно вказати короткий опис статті',
    'r_message' => 'Необхідно вказати повний текст статті'
];